import { Component } from "react";

import logo from "../../assets/images/logo 2.svg";
import "./media.scss";

export class Footer extends Component {
  render() {
    return (
      <footer>
        <div className={`footer__container container`}>
          <div className="footer__top">
            <div className="left">
              <a href="najottalim.uz">
                <img src={logo} alt="" />
              </a>
            </div>
            <div className="right">
              <div className="footer_social_card">
                <a
                  className="socialContainer containerOne"
                  href="najottalim.uz"
                >
                  <svg
                    viewBox="0 0 30 19"
                    fill="none"
                    xmlns="http://www.w3.org/2000/svg"
                    className="socialSvg instagramSvg"
                  >
                    <path
                      d="M29.3122 1.97563C29.5218 1.2622 29.3122 0.739014 28.3211 0.739014H25.0379C24.2025 0.739014 23.8207 1.19162 23.6111 1.68873C23.6111 1.68873 21.9418 5.8604 19.5764 8.56532C18.8128 9.3524 18.464 9.60095 18.0478 9.60095C17.8397 9.60095 17.5373 9.3524 17.5373 8.63896V1.97563C17.5373 1.11951 17.2963 0.739014 16.6001 0.739014H11.441C10.92 0.739014 10.6056 1.13486 10.6056 1.51229C10.6056 2.32238 11.7883 2.50956 11.9096 4.79255V9.74517C11.9096 10.8299 11.7195 11.0278 11.3003 11.0278C10.1879 11.0278 7.48112 6.8408 5.87471 2.04775C5.56181 1.11644 5.24592 0.740549 4.40753 0.740549H1.12584C0.18714 0.740549 0 1.19316 0 1.69026C0 2.58321 1.11236 7.0019 5.18154 12.8459C7.89433 16.8366 11.7135 18.9999 15.1928 18.9999C17.2783 18.9999 17.5358 18.5197 17.5358 17.6912V14.6748C17.5358 13.7143 17.7349 13.521 18.3951 13.521C18.8802 13.521 19.7156 13.7726 21.6634 15.6951C23.8881 17.975 24.2564 18.9984 25.5065 18.9984H28.7882C29.7254 18.9984 30.194 18.5181 29.9245 17.5699C29.6295 16.6264 28.5666 15.2532 27.1563 13.6284C26.3898 12.7017 25.2445 11.7044 24.8956 11.2058C24.4091 10.5629 24.5498 10.2791 24.8956 9.70835C24.8971 9.70989 28.896 3.93796 29.3122 1.97563Z"
                      fill="#fff"
                    />
                  </svg>
                </a>
                <a
                  className="socialContainer containerTwo"
                  href="najottalim.uz"
                >
                  <svg
                    width="25px"
                    height="25px"
                    viewBox="0 0 19 30"
                    fill="none"
                    xmlns="http://www.w3.org/2000/svg"
                    className="socialSvg twitterSvg"
                  >
                    <path
                      d="M18.2609 0.842911C18.2609 0.62197 18.1734 0.410078 18.0178 0.253849C17.8621 0.0976202 17.651 0.00985146 17.4308 0.00985146H13.2806C11.1908 -0.0946294 9.14471 0.635298 7.58942 2.04015C6.03413 3.445 5.09609 5.41057 4.98024 7.50739V12.0059H0.83004C0.609899 12.0059 0.398776 12.0937 0.243113 12.2499C0.0874505 12.4061 0 12.618 0 12.839V17.1709C0 17.3918 0.0874505 17.6037 0.243113 17.7599C0.398776 17.9162 0.609899 18.0039 0.83004 18.0039H4.98024V29.1669C4.98024 29.3879 5.06769 29.5998 5.22335 29.756C5.37901 29.9122 5.59014 30 5.81028 30H10.7905C11.0107 30 11.2218 29.9122 11.3774 29.756C11.5331 29.5998 11.6206 29.3879 11.6206 29.1669V18.0039H15.97C16.1545 18.0066 16.3347 17.9474 16.4821 17.8358C16.6294 17.7241 16.7354 17.5664 16.7834 17.3875L17.9787 13.0556C18.0117 12.9325 18.0161 12.8034 17.9916 12.6783C17.9671 12.5533 17.9144 12.4355 17.8374 12.3341C17.7604 12.2327 17.6613 12.1504 17.5476 12.0935C17.434 12.0366 17.3088 12.0066 17.1818 12.0059H11.6206V7.50739C11.6618 7.09499 11.8548 6.71284 12.1618 6.43556C12.4687 6.15829 12.8677 6.0058 13.2806 6.00788H17.4308C17.651 6.00788 17.8621 5.92011 18.0178 5.76388C18.1734 5.60765 18.2609 5.39576 18.2609 5.17482V0.842911Z"
                      fill="#fff"
                    />
                  </svg>
                </a>
                <a
                  className="socialContainer containerThree"
                  href="najottalim.uz"
                >
                  <svg viewBox="0 0 448 512" className="socialSvg linkdinSvg">
                    <path d="M100.28 448H7.4V148.9h92.88zM53.79 108.1C24.09 108.1 0 83.5 0 53.8a53.79 53.79 0 0 1 107.58 0c0 29.7-24.1 54.3-53.79 54.3zM447.9 448h-92.68V302.4c0-34.7-.7-79.2-48.29-79.2-48.29 0-55.69 37.7-55.69 76.7V448h-92.78V148.9h89.08v40.8h1.3c12.4-23.5 42.69-48.3 87.88-48.3 94 0 111.28 61.9 111.28 142.3V448z"></path>
                  </svg>
                </a>
              </div>
            </div>
          </div>
          <div className="footer__bottom">
            <div className="menu">
              <div className="left">
                <ul>
                  <h3>Продукция</h3>
                  <li>
                    <a href="najottalim.uz">Ламинатные тубы</a>
                  </li>
                  <li>
                    <a href="najottalim.uz">Экструзионные тубы</a>
                  </li>
                  <li>
                    <a href="najottalim.uz">Другая упаковка</a>
                  </li>
                </ul>
                <ul>
                  <h3>Компания</h3>
                  <li>
                    <a href="najottalim.uz">О нас</a>
                  </li>
                  <li>
                    <a href="najottalim.uz">Наша команда</a>
                  </li>
                  <li>
                    <a href="najottalim.uz">Сертификаты</a>
                  </li>
                </ul>
                <ul>
                  <h3>Разделы</h3>
                  <li>
                    <a href="najottalim.uz">Контакты</a>
                  </li>
                  <li>
                    <a href="najottalim.uz">Новости</a>
                  </li>
                  <li>
                    <a href="najottalim.uz">Вакансии</a>
                  </li>
                </ul>
              </div>
              <div className="right">
                <ul>
                  <h4>Беларусь</h4>
                  <li>
                    <a href="najottalim.uz">+375 (17) 270 53 77</a>
                  </li>
                  <li>
                    <a href="najottalim.uz">+375 (17) 270 53 78</a>
                  </li>
                </ul>
                <ul>
                  <h4>Европа</h4>
                  <li>
                    <a href="najottalim.uz">+48 73 1111 044</a>
                  </li>
                  <li>
                    <a href="najottalim.uz">+375 (17) 270 53 77</a>
                  </li>
                </ul>
                <ul>
                  <h4>Москва</h4>
                  <li>
                    <a href="najottalim.uz">+7 (495) 280 73 44</a>
                  </li>
                  <li>
                    <a href="najottalim.uz">+7 (495) 280 73 44</a>
                  </li>
                </ul>
                <ul>
                  <h4>Екатеринбург</h4>
                  <li>
                    <a href="najottalim.uz">+7 (343) 346 82 06</a>
                  </li>
                  <li>
                    <a href="najottalim.uz">+375 (17) 270 53 77</a>
                  </li>
                </ul>
              </div>
            </div>
            <div className="end">
              <p>
                © 2022 Leangroup. All Rights Reserved. Разработка и продвижение
                сайтов SkyWeb.by
              </p>
            </div>
          </div>
        </div>
      </footer>
    );
  }
}

export default Footer;
